[
    [
        "<p>Ben organizes a ping pong game with his friends in his courtyard.<br>Knowing that their house is old and the windows are extremely fragile, Ben’s mom asks him to avoid letting anything hit the window. She then gets in her car and drives away to the grocery store.<br>During the game, a stray ping pong ball bounces against one of the windows. The window immediately breaks.</p><p><strong>Question:</strong> Astonished, Ben's friend Joe asks Ben: “Why did the window break?”</p><p><strong>Explanation 1:</strong> Our house is very old, and the windows are extremely fragile.</p><p><strong>Explanation 2:</strong> A ping pong ball hit the window.</p>",
        "<p>Jack’s friend is a former college swimmer.<br>\r\rHe’s just joined his town’s triathlon club. Since he needs to practice cycling and running, he starts practicing cycling and running with the triathlon club 4 times a week. There is a triathlon coming up in one month.<br>\r\rAt his first triathlon, after a month of practicing, Jack scores first!</p><p><strong>Question:</strong> One of his triathlon club members asks him: “How did you win the triathlon?”</p><p><strong>Explanation 1:</strong> I was a college swimmer before I started triathlon training.</p><p><strong>Explanation 2:</strong> I was practicing for the triathlon 4 times a week last month.</p>",
        "<p>Linda is organizing an exhibition for her ceramics class.<br>She discovers that one of the tables that the ceramics have been placed on, while ordinarily quite secure, is missing a screw. She tells Patrick – a volunteer at the exhibition – about the faulty table, and asks him to let the other volunteer, Elizabeth know as well. <br>Linda walks away. <br>Before Patrick can tell Elizabeth, Elizabeth comes over and places another ceramic pot onto the table. The table collapses, and all of the ceramics on it break.</p><p><strong>Question:</strong> Elizabeth exclaims: “Why did the table collapse?”</p><p><strong>Explanation 1:</strong> You put another pot onto the table.</p><p><strong>Explanation 2:</strong> The table was missing a screw.</p>",
        "<p>Sam and Will are building a model airplane for their engineering class.<br>Together, after class, they come up with an innovative new wing design, which they keep secret from everyone in the class as a surprise for the demonstration day.<br>Will still isn’t satisfied, so he separately goes to the Professor’s office hours an hour before for advice. The professor advises him to swap the wooden tail fins on the plane for metal ones – they look exactly the same, but tend to work much better.<br>At the demonstration an hour later, the plane flies 200 feet further than everyone else’s plane!</p><p><strong>Question:</strong> Sam turns to Will and asks: “Why did the plane fly so far?”</p><p><strong>Explanation 1:</strong> “The plane has an innovative new wing design, which improves the performance.”</p><p><strong>Explanation 2:</strong> “I swapped the tail fins from wood ones to metal ones.”</p>",
        "<p>Dan owns a bakery. <br>Early in the day, he stops by the bakery kitchen to see his three employees. Two of the bakers let him know that they will be going on vacation, and the last one, John, says that he will be sticking around. John is a skilled baker who can generally cover for everyone in a pinch. <br>Later in the day, Dan goes to a meeting in town with the bakery’s financial manager, Sarah and their kitchen supplier, Jonah. <br>At the meeting, Jonah first announces that there is an icing shortage, so all icing will need to be prepared by hand this week, which takes twice as long. <br>Sarah then tells Dan that they’ve received a rush order for a large number of cakes that need to be delivered the next day. Dan says they shouldn’t take the order. </p><p><strong>Question:</strong> Sarah says: “Why shouldn’t we take the order?”</p><p><strong>Explanation 1:</strong> There’s an icing shortage, so preparing icing will take twice as long.</p><p><strong>Explanation 2:</strong> Two of our bakers are on vacation this week.</p>",
        "<p>Mike and George are gym buddies and decide to meet and pick out some weights for a home gym.\r\rBefore leaving the house, Mike’s wife Tracey mentions that their red kitchen chair needs repairing because one of the legs is cracked.\r\rWhen they get back, George sets the new weights on the chair, but it collapses.\r</p><p><strong>Question:</strong> George asks Mike: Why did the chair break?</p><p><strong>Explanation 1:</strong> One of the chair legs is cracked.</p><p><strong>Explanation 2:</strong> You put the new dumbbells down on the chair.</p>",
        "<p>Dennis, Tommy, and Jack are brothers who want to surprise their mother for her birthday tomorrow by making her homemade lasagna. <br>\r\rDennis and Tommy go to the store together to pick up some tomatoes. Unfortunately, the only tomatoes available are pretty soft, but they decide to get them anyway. <br>\r\rTommy then goes off to baseball practice.\rWhile he is at practice, Jack suggests hiding all of the lasagna ingredients in their bedroom, so that their mom won’t discover them. Dennis brings the tomatoes and pasta into Jack’s room.<br> \r\rThe next morning, when everyone is back together in the kitchen, Dennis puts all of the ingredients on the table, and the brothers discover that the tomatoes are completely rotten.</p><p><strong>Question:</strong> Tommy turns to Dennis and says: “Why did the tomatoes rot so quickly?”</p><p><strong>Explanation 1:</strong> They were already pretty soft when we bought them.</p><p><strong>Explanation 2:</strong> They haven’t been in the fridge.</p>",
        "<p>Emily is trying to make it to a surprise birthday party in the next hour. It only takes 10 minutes to drive there, so she has lots of time.<br>Since she lives so close, her friend Sophie asks her to stop by and pick up a birthday card along the way – it’ll only take a few minutes.<br>Meanwhile, her friend John warns her that there’s a little traffic along the way that he and Emily both take there, so he lets her know that he’s going to go a bit early – but there’s not too much traffic, so it shouldn’t be a problem.<br>Emily goes to pick up the card. She then gets stuck in the traffic. She winds up late to the surprise party.</p><p><strong>Question:</strong> When she gets there, Sophie asks, surprised: Why were you late to the party?</p><p><strong>Explanation 1:</strong> There was traffic along the way.</p><p><strong>Explanation 2:</strong> I also picked up a greeting card on the way there.</p>",
        "<p>Ryan goes to the store with his friend Joe to get a phone case. <br>\r\rThe clerk tells them that they have a new phone that is partly waterproof, though not perfect. Ryan and Joe both buy one of these phones. <br>\r\rThe next day, Ryan’s friend Paul mentions that he has some leftover screen protecting spray  that offers a bit of water protection as well, though not a lot. Ryan thanks Paul, takes the screen protector and sprays the screen protector on his phone.</p><p><strong>Question:</strong> The next day, Ryan is out on a hike with Paul.<br>\r\rHe drops his phone in a lake. By the time they fish it out, it’s soaked. But when Ryan tests it, it turns on!<br>\r\rWow, says Paul. Why didn’t your phone break after all that time in the water?</p><p><strong>Explanation 1:</strong> I used your waterproof screen protecting spray.</p><p><strong>Explanation 2:</strong> My phone was already partly waterproof.</p>",
        "<p>Nick and Andrew are getting groceries.<br>\r\rAt the grocery store, the cashier lets Nick and Andrew know that the store has switched to using eco-friendly bags that are a bit weaker than usual.<br>\r\rThere’s a lot of groceries, so Nick goes to pull the car to the front while Andrew continues packing.<br>\rSince each bag costs money, and he is in the rush, Andrew puts a bunch of potatoes into the last bag.<br>\r\rAs he carries the bag to the car, the bag breaks.<br></p><p><strong>Question:</strong> Nick asks, why did the bag break?<br><p><strong>Explanation 1:</strong> I was in a rush, so I put a bunch of potatoes in the last bag.</p><p><strong>Explanation 2:</strong> The store switched to using eco-friendly bags that are a bit weaker than usual.</p>",
        "<p>Joe works in an office that has recently installed a metal detector at the entrance. This metal detector is known to only trigger an alarm when someone carries a significant amount of metal. <br> One day, a new coworker brings in a set of dumbbells made of metal for his office workouts. Intriguingly, when the coworker first brings them in, the metal detector does not react.</p><p><strong>Question:</strong> Joe decides to borrow these dumbbells to use at home. He picks them up and leaves the office with his wife. As they exit together, for the first time, the metal detector goes off, startling them both. Surprised, Joe's wife asks him: \"Why does the metal detector go off now?\"</p><p><strong>Explanation 1:</strong> My prosthetic leg, which is made out of metal, must have exceeded the threshold required to trigger the alarm.</p><p><strong>Explanation 2:</strong> I have dumbbells in my bag, which must have exceeded the threshold to trigger the alarm.</p>",
        "<p>Anna's mom recently buys her a new phone. During the purchase, Anna's mom chooses a phone plan with only 1GB of data per month, thinking it would be sufficient. Anna agrees, confident she doesn't use much data.<br>\r\rOne afternoon, Anna's friend needs to download a large file for a class assignment. Without access to Wi-Fi, she borrows Anna's phone to download this file. The download is successful.</p><p><strong>Question:</strong> Later that day, the same friend needs to download another file, this time a smaller one, for the same class. She borrows Anna's phone again, but this time, the download doesn't work. Confused, she asks Anna, “Why isn’t it downloading?”</p><p><strong>Explanation 1:</strong> \"We might have used up the data limit with that big file you downloaded earlier.\"</p><p><strong>Explanation 2:</strong> \"My phone plan doesn't have a lot of data.\"</p>",
        "<p>Joe and his wife have an emergency lamp in their house. This lamp is designed to plug into the wall but also includes backup batteries for power outages. Over time, they notice the bulb has burnt out. However, since they rarely use the lamp, they don't immediately replace the bulb. <br>\r\rOne day, Joe goes to the hardware store with his friend, Mike. Remembering the burnt-out bulb, he decides to buy a replacement. Once home, he installs the new bulb in the emergency lamp.</p><p><strong>Question:</strong> Later, at a dinner party with friends, Joe demonstrates the lamp again. He flicks the switch, and the lamp lights up, despite being noticeably unplugged. Mike, witnessing this, turns to him and asks, “Why is the lamp working?”</p><p><strong>Explanation 1:</strong> \"I changed the bulb.\"</p><p><strong>Explanation 2:</strong> \"It has backup batteries.\"</p>",
        "<p>Joe has a late dinner tonight with his friends Tracey and Paul.\r\rThe reservation is quite late in the evening, so since Joe and Tracey are coworkers, they have a late lunch.\r\rJoe needs to drop off a package at Paul’s house, so he stops by Paul’s house before dinner. They both have a little snack to tide themselves over, then head to the restaurant.\r\rAt the restaurant, the dinner takes forever to arrive – it’s even slower than expected! Joe sits at dinner, but his friends look famished.\r</p><p><strong>Question:</strong> In the bathroom, Paul turns to Joe. Wow, he says, that took forever. Why aren’t you completely starving?</p><p><strong>Explanation 1:</strong> I had a late lunch.</p><p><strong>Explanation 2:</strong> I had an extra snack along the way.</p>"
    ],
    [
        "<p>Ben organizes a ping pong game with his friends in his courtyard.<br>Knowing that their house is old and the windows are extremely fragile, Ben’s mom asks him to avoid letting anything hit the window. She then gets in her car and drives away to the grocery store.<br>During the game, a stray ping pong ball bounces against one of the windows. The window immediately breaks.</p><p><strong>Question:</strong> About 30 minutes later, Ben’s mom returns and sees that the window is broken!<br>Astonished, Ben’s mom asks Ben: “Why did the window break?” </p><p><strong>Explanation 1:</strong> Our house is very old, and the windows are extremely fragile.</p><p><strong>Explanation 2:</strong> A ping pong ball hit the window.</p>",
        "<p>Jack’s friend is a former college swimmer.<br>\r\rHe’s just joined his town’s triathlon club. Since he needs to practice cycling and running, he starts practicing cycling and running with the triathlon club 4 times a week. There is a triathlon coming up in one month.<br>\r\rAt his first triathlon, after a month of practicing, Jack scores first!</p><p><strong>Question:</strong> One of his former swimming teammates has been out of town all month, and hasn’t known about what Jack has been up to, but happens to be at the triathlon to watch a few of their friends. His teammate asks him: “How did you win the triathlon?”</p><p><strong>Explanation 1:</strong> I was a college swimmer before I started triathlon training.</p><p><strong>Explanation 2:</strong> I was practicing for the triathlon 4 times a week last month.</p>",
        "<p>Linda is organizing an exhibition for her ceramics class.<br>She discovers that one of the tables that the ceramics have been placed on, while ordinarily quite secure, is missing a screw. She tells Patrick – a volunteer at the exhibition – about the faulty table, and asks him to let the other volunteer, Elizabeth know as well. <br>Linda walks away. <br>Before Patrick can tell Elizabeth, Elizabeth comes over and places another ceramic pot onto the table. The table collapses, and all of the ceramics on it break.</p><p><strong>Question:</strong> Elizabeth exclaims: “Why did the table collapse?”</p><p><strong>Explanation 1:</strong> Elizabeth put another pot onto the table.</p><p><strong>Explanation 2:</strong> The table was missing a screw.</p>",
        "<p>Sam and Will are building a model airplane for their engineering class.<br>Together, after class, they come up with an innovative new wing design, which they keep secret from everyone in the class as a surprise for the demonstration day.<br>Will still isn’t satisfied, so he separately goes to the Professor’s office hours an hour before for advice. The professor advises him to swap the wooden tail fins on the plane for metal ones – they look exactly the same, but tend to work much better.<br>At the demonstration an hour later, the plane flies 200 feet further than everyone else’s plane!</p><p><strong>Question:</strong> The professor comes up to Will and Sam to congratulate them and asks: “Why did the plane fly so far?”</p><p><strong>Explanation 1:</strong> “The plane has an innovative new wing design, which improves the performance.”</p><p><strong>Explanation 2:</strong> “I swapped the tail fins from wood ones to metal ones.”</p>",
        "<p>Dan owns a bakery. <br>Early in the day, he stops by the bakery kitchen to see his three employees. Two of the bakers let him know that they will be going on vacation, and the last one, John, says that he will be sticking around. John is a skilled baker who can generally cover for everyone in a pinch. <br>Later in the day, Dan goes to a meeting in town with the bakery’s financial manager, Sarah and their kitchen supplier, Jonah. <br>At the meeting, Jonah first announces that there is an icing shortage, so all icing will need to be prepared by hand this week, which takes twice as long. <br>Sarah then tells Dan that they’ve received a rush order for a large number of cakes that need to be delivered the next day. Dan says they shouldn’t take the order. </p><p><strong>Question:</strong> Back at the bakery, Dan mentions that he decided not to take the rush order.\r\rJohn asks: “Why shouldn’t we take the order?”</p><p><strong>Explanation 1:</strong> There’s an icing shortage, so preparing icing will take twice as long.</p><p><strong>Explanation 2:</strong> Two of our bakers are on vacation this week.</p>",
        "<p>Mike and George are gym buddies and decide to meet and pick out some weights for a home gym.\r\rBefore leaving the house, Mike’s wife Tracey mentions that their red kitchen chair needs repairing because one of the legs is cracked.\r\rWhen they get back, George sets the new weights on the chair, but it collapses.\r</p><p><strong>Question:</strong> When Mike’s wife comes back, she asks him: why did the chair break?</p><p><strong>Explanation 1:</strong> One of the chair legs is cracked.</p><p><strong>Explanation 2:</strong> You put the new dumbbells down on the chair.</p>",
        "<p>Dennis, Tommy, and Jack are brothers who want to surprise their mother for her birthday tomorrow by making her homemade lasagna. <br>\r\rDennis and Tommy go to the store together to pick up some tomatoes. Unfortunately, the only tomatoes available are pretty soft, but they decide to get them anyway. <br>\r\rTommy then goes off to baseball practice.\rWhile he is at practice, Jack suggests hiding all of the lasagna ingredients in their bedroom, so that their mom won’t discover them. Dennis brings the tomatoes and pasta into Jack’s room.<br> \r\rThe next morning, when everyone is back together in the kitchen, Dennis puts all of the ingredients on the table, and the brothers discover that the tomatoes are completely rotten.</p><p><strong>Question:</strong> Jack turns to Dennis and says: “Why did the tomatoes rot so quickly?”</p><p><strong>Explanation 1:</strong> They were already pretty soft when we bought them.</p><p><strong>Explanation 2:</strong> They haven’t been in the fridge.</p>",
        "<p>Emily is trying to make it to a surprise birthday party in the next hour. It only takes 10 minutes to drive there, so she has lots of time.<br>Since she lives so close, her friend Sophie asks her to stop by and pick up a birthday card along the way – it’ll only take a few minutes.<br>Meanwhile, her friend John warns her that there’s a little traffic along the way that he and Emily both take there, so he lets her know that he’s going to go a bit early – but there’s not too much traffic, so it shouldn’t be a problem.<br>Emily goes to pick up the card. She then gets stuck in the traffic. She winds up late to the surprise party.</p><p><strong>Question:</strong> When she gets there, John asks, surprised: Why were you late to the party?</p><p><strong>Explanation 1:</strong> There was traffic along the way.</p><p><strong>Explanation 2:</strong> I also picked up a greeting card on the way there.</p>",
        "<p>Ryan goes to the store with his friend Joe to get a phone case. <br>\r\rThe clerk tells them that they have a new phone that is partly waterproof, though not perfect. Ryan and Joe both buy one of these phones. <br>\r\rThe next day, Ryan’s friend Paul mentions that he has some leftover screen protecting spray  that offers a bit of water protection as well, though not a lot. Ryan thanks Paul, takes the screen protector and sprays the screen protector on his phone.</p><p><strong>Question:</strong> The next day, Ryan is out on a hike with Joe.<br>\r\rHe drops his phone in a lake. By the time they fish it out, it’s soaked. But when Ryan tests it, it turns on!<br>\r\rWow, says Joe. Why didn’t your phone break after all that time in the water?</p><p><strong>Explanation 1:</strong> I used Paul’s waterproof screen protecting spray.</p><p><strong>Explanation 2:</strong> My phone was already partly waterproof.</p>",
        "<p>Nick and Andrew are getting groceries.<br>\r\rAt the grocery store, the cashier lets Nick and Andrew know that the store has switched to using eco-friendly bags that are a bit weaker than usual.<br>\r\rThere’s a lot of groceries, so Nick goes to pull the car to the front while Andrew continues packing.<br>\rSince each bag costs money, and he is in the rush, Andrew puts a bunch of potatoes into the last bag.<br>\r\rAs he carries the bag to the car, the bag breaks.<br></p><p><strong>Question:</strong> A passerby outside the store who stops to help pick up the groceries asks, why did the bag break? </p><p><strong>Explanation 1:</strong> I was in a rush, so I put a bunch of potatoes in the last bag.</p><p><strong>Explanation 2:</strong> The store switched to using eco-friendly bags that are a bit weaker than usual.</p>",
        "<p>Joe works in an office that has recently installed a metal detector at the entrance. This metal detector is known to only trigger an alarm when someone carries a significant amount of metal. <br> One day, a new coworker brings in a set of dumbbells made of metal for his office workouts. Intriguingly, when the coworker first brings them in, the metal detector does not react.</p><p><strong>Question:</strong> Joe decides to borrow these dumbbells to use at home. He picks them up and leaves the office with his colleague who helps him with the dumbbells. As they exit together, for the first time, the metal detector goes off, startling them both. Surprised, Joe's colleague asks him: \"Why does the metal detector go off now?\"</p><p><strong>Explanation 1:</strong> My prosthetic leg, which is made out of metal, must have exceeded the threshold required to trigger the alarm.</p><p><strong>Explanation 2:</strong> I have dumbbells in my bag, which must have exceeded the threshold to trigger the alarm.</p>",
        "<p>Anna's mom recently buys her a new phone. During the purchase, Anna's mom chooses a phone plan with only 1GB of data per month, thinking it would be sufficient. Anna agrees, confident she doesn't use much data.<br>\r\rOne afternoon, Anna's friend needs to download a large file for a class assignment. Without access to Wi-Fi, she borrows Anna's phone to download this file. The download is successful.</p><p><strong>Question:</strong> On the car ride home, Anna's mom asks her to download a small file. When the download doesn't start, her mom is perplexed and asks, “Why isn’t it downloading?”</p><p><strong>Explanation 1:</strong> \"I might have used up the data limit with a big file my friend downloaded earlier.\"</p><p><strong>Explanation 2:</strong> \"My phone plan doesn't have a lot of data.\"</p>",
        "<p>Joe and his wife have an emergency lamp in their house. This lamp is designed to plug into the wall but also includes backup batteries for power outages. Over time, they notice the bulb has burnt out. However, since they rarely use the lamp, they don't immediately replace the bulb. <br>\r\rOne day, Joe goes to the hardware store with his friend, Mike. Remembering the burnt-out bulb, he decides to buy a replacement. Once home, he installs the new bulb in the emergency lamp.</p><p><strong>Question:</strong> That evening, during dinner with his wife, Joe decides to test the lamp. He flicks the switch, and the lamp lights up, even though it's visibly unplugged from the wall. Surprised, his wife asks, “Why is the lamp working?”</p><p><strong>Explanation 1:</strong> \"I changed the bulb.\"</p><p><strong>Explanation 2:</strong> \"It has backup batteries.\"</p>",
        "<p>Joe has a late dinner tonight with his friends Tracey and Paul.\r\rThe reservation is quite late in the evening, so since Joe and Tracey are coworkers, they have a late lunch.\r\rJoe needs to drop off a package at Paul’s house, so he stops by Paul’s house before dinner. They both have a little snack to tide themselves over, then head to the restaurant.\r\rAt the restaurant, the dinner takes forever to arrive – it’s even slower than expected! Joe sits at dinner, but his friends look famished.\r</p><p><strong>Question:</strong> While Paul is in the bathroom, Tracey turns to Joe. Wow, he says, that took forever. Why aren’t you completely starving? </p><p><strong>Explanation 1:</strong> I had a late lunch.</p><p><strong>Explanation 2:</strong> I had an extra snack along the way.</p>"
    ]
]